import { images } from '../assets/images';

export const services = [
  {
    id: 'gastroenterology',
    title: 'Գաստրոէնտերոլոգիա',
    icon: images.service5,
    description: 'Մեր գաստրոէնտերոլոգիական բաժինը զբաղվում է մարսողական համակարգի հիվանդությունների ախտորոշմամբ և բուժմամբ: Մենք առաջարկում ենք մանրակրկիտ հետազոտություններ և բուժում ստամոքսի, աղիների, լյարդի, լեղապարկի և ենթաստամոքսային գեղձի խնդիրների համար:',
    features: [
      'Վերին և ստորին մարսողական ուղիների էնդոսկոպիա՝ կոլոնոսկոպիա, գաստրոսկոպիա',
      'Բիոպսիա',
      'Պոլիպների հեռացում',
      'Մարսողական համակարգից արյունահոսությունների դադարեցում',
      'Անհրաժեշտ բոլոր լաբորատոր հետազոտությունները'
    ]
  },
  {
    id: 'gynecology',
    title: 'Գինեկոլոգիա',
    icon: images.service6,
    description: 'Մեր գինեկոլոգիայի բաժինը առաջարկում է կանանց առողջության համապարփակ խնամք՝ սկսած կանխարգելիչ զննումներից մինչև բարդ վիրահատական միջամտություններ: Մեր ծառայությունները ներառում են տարեկան զննումներ, հակաբեղմնավորիչ խորհրդատվություն, հղիության վարում և գինեկոլոգիական հիվանդությունների բուժում:',
    features: [
      'Անկանոն դաշտանային ցիկլ',
      'Ուժեղ ցավ դաշտանի ժամանակ',
      'Հակաբեղմնավորիչների ընտրություն կատարելու դժվարություն',
      'Հղիության պլանավորում',
      'Հղիության վարում'
    ]
  },
  {
    id: 'endocrinology',
    title: 'Էնդոկրինոլոգիա',
    icon: images.service7,
    description: 'Մեր էնդոկրինոլոգիայի բաժինը մասնագիտացած է հորմոնալ հիվանդությունների ախտորոշման և բուժման մեջ: Մենք առաջարկում ենք համակողմանի բուժում շաքարային դիաբետի, վահանաձև գեղձի խանգարումների, մակերիկամների հիվանդությունների և այլ էնդոկրին խնդիրների համար:',
    features: [
      'Շաքարային դիաբետի վերահսկում և բուժում',
      'Ապրելակերպի և սննդակարգի անհատական խորհրդատվություն',
      'Շաքար իջեցնող հաբերի նշանակում միջազգային ուղեցույցերի հիման վրա',
      'Վահանագեղձի համալիր հետազոտում և բուժում',
    ]
  },
  {
    id: 'family-medicine',
    title: 'Թերապիա | Ընտանեկան բժշկություն',
    icon: images.service8,
    description: 'Ընտանեկան բժիշկները զբաղվում են տարբեր խնդիրների ախտորոշմամբ և բուժմամբ՝ պարզ հիվանդություններից մինչև քրոնիկական վիճակներ: Մենք առաջարկում ենք կանխարգելիչ խնամք, պատվաստումներ, տարեկան բժշկական զննումներ և անհատականացված առողջապահական խորհրդատվություն:',
    features: [
      'Նեղ մասնագետների խորհրդատվություն',
      'Ուլտրաձայնային հետազոտություն',
      'Էլեկտրասրտագրություն',
      'Արյան նմուշառում',
      'Ներերակային կաթիլային ներարկում'
    ]
  },
  {
    id: 'pulmonology',
    title: 'Թոքաբանություն | Բրոնխոսկոպիա',
    icon: images.service9,
    description: 'Այս բաժինը մասնագիտացած է շնչառական համակարգի հիվանդությունների ախտորոշման և բուժման մեջ: Մենք առաջարկում ենք ժամանակակից դիագնոստիկ ծառայություններ, ներառյալ բրոնխոսկոպիա, թոքերի ֆունկցիոնալ թեստեր և ճառագայթաբանական հետազոտություններ: Մեր թոքաբանները բուժում են ասթմա, քրոնիկ օբստրուկտիվ թոքային հիվանդություն (ՔՕԹՀ), թոքաբորբ և շնչառական այլ խնդիրներ՝ օգտագործելով նորագույն բուժման մեթոդներ:',
    features: [
      'Քրոնիկ կամ ձգձգված հազ',
      'Սուր և քրոնիկ բրոնխիտ',
      'Թոքաբորբ',
      'Սարկոիդոզ',
      'Բրոնխէկտատիկ հիվանդություն',
      'Բրոնխիոլիտ'
    ]
  },
  {
    id: 'kinesitherapy',
    title: 'Կինեզոթերապիա',
    icon: images.service10,
    description: 'Մեր կինեզոթերապիայի բաժինը առաջարկում է անհատականացված ֆիզիկական վերականգնողական ծրագրեր տարբեր վնասվածքների և հիվանդությունների դեպքում: Մենք աշխատում ենք օրթոպեդիկ վնասվածքների, նյարդաբանական խանգարումների, սպորտային վնասվածքների վերականգնման, ինչպես նաև վիրահատություններից հետո ապաքինման ուղղությամբ:',
    features: [
      'Հենաշարժական համակարգի խնդիրներ',
      'Նյարդաբանական հիվանդություններ',
      'Կոտրվածքներից հետո վերականգնում',
      'Վերջույթների անդամահատումներ, պրոթեզավորում',
      'Կեցվածքի շեղումներ'
    ]
  },
  {
    id: 'psychology',
    title: 'Հոգեբանություն',
    icon: images.service11,
    description: 'Մեր հոգեբանության բաժինը տրամադրում է հոգեկան առողջության համապարփակ աջակցություն: Մեր որակավորված հոգեբանները օգնում են հաղթահարել սթրեսը, տագնապը, դեպրեսիան և այլ հոգեբանական խնդիրներ:',
    features: [
      'Հոգեբանական խորհրդատվություն',
      'Հոգեբանական գնահատում',
      'Մանկական հոգեբանություն',
      'Ընտանեկան խորհրդատվություն',
      'Սթրեսի և տագնապի կառավարում',
      'Դեպրեսիայի բուժում'
    ]
  },
  {
    id: 'pediatrics',
    title: 'Մանկաբուժություն',
    icon: images.service3,
    description: 'Մեր մանկաբուժության բաժինը հոգ է տանում երեխաների առողջության մասին՝ նորածնային շրջանից մինչև դեռահասություն: Մենք առաջարկում ենք կանխարգելիչ խնամք աճի և զարգացման համար, պատվաստումներ, սուր և քրոնիկական մանկական հիվանդությունների բուժում:',
    features: [
      'Նյարդաբանություն',
      'Ուրոլոգիա',
      'Քիթ-կոկորդ-ականջաբանություն',
      'Ակնաբուժություն',
      'Մանկական վերականգնողաբանի ծառայություններ',
      'Պատվաստումներ և աճի հսկողություն'
    ]
  },
  {
    id: 'dermatology',
    title: 'Մաշկաբանություն',
    icon: images.service12,
    description: 'Մեր մաշկաբանության բաժինը մասնագիտացած է մաշկի, մազերի և եղունգների հիվանդությունների ախտորոշման և բուժման մեջ: Մենք բուժում ենք ակնե, էկզեմա, պսորիազ, մաշկի ալերգիաներ և այլ մաշկային խնդիրներ: Բաժինը նաև առաջարկում է կոսմետիկ միջամտություններ՝ մաշկի երիտասարդացում և մաշկի ընդհանուր առողջության պահպանում:',
    features: [
      'Մաշկային սուր և քրոնիկ հիվանդությունների ախտորում և բուժում',
      'Պսորիազի, վիտիլիգոյի բուժում` լազերային եղանակով',
      'Մաշկային գոյացությունների հետազոտություն՝ դերմատոսկոպիա',
      'Բարորակ նորագոյացությունների, խալերի հեռացում՝ լազերային և վիրաբուժական եղանակով'
    ]
  },
  {
    id: 'neurology',
    title: 'Նյարդաբանություն',
    icon: images.service2,
    description: 'Մեր նյարդաբանության բաժինը զբաղվում է ուղեղի, ողնուղեղի և նյարդային համակարգի խանգարումների ախտորոշմամբ և բուժմամբ: Մեր նյարդաբանները բուժում են գլխացավեր, միգրեններ, էպիլեպսիա, ինսուլտ, Պարկինսոնի հիվանդություն, ցրված սկլերոզ և այլ նյարդաբանական վիճակներ: Մենք առաջարկում ենք նյարդաբանական հետազոտություններ, էլեկտրոէնցեֆալոգրաֆիա և նյարդային համակարգի այլ դիագնոստիկ թեստեր:',
    features: [
      'Տարբեր բնույթի գլխացավեր',
      'Դիմային ցավ',
      'Գլխապտույտ',
      'Ողնաշարի տարածուն ցավեր',
      'Քայլքի և հավասարակշռության խանգարում',
      'Անքնություն, հիշողության խանգարում'
    ]
  },
  {
    id: 'urology',
    title: 'Ուրոլոգիա',
    icon: images.service13,
    description: 'Մեր ուրոլոգիայի բաժինը բուժում է միզուղիների և արական վերարտադրողական համակարգի խնդիրները: Մեր ուրոլոգները մասնագիտացած են երիկամների քարերի, միզապարկի խնդիրների, շագանակագեղձի հիվանդությունների, անպտղության և այլ ուրոլոգիական հիվանդությունների բուժման մեջ:',
    features: [
      'Երիկամների, միզապարկի, շագանակագեղձի, առնանդամի, ամորձիների թարախա-բորբոքային հիվանդություններ',
      'Սեռավարակներ',
      'Երիկամային խիթ',
      'Շագանակագեղձի բարորակ գերաճ (հիպերպլազիա)'
    ]
  },
  {
    id: 'radiology',
    title: 'Ռենտգեն',
    icon: images.service14,
    description: 'Մեր ռենտգենաբանական բաժինը հագեցած է ժամանակակից սարքավորումներով՝ բարձրորակ ախտորոշիչ պատկերներ տրամադրելու համար: Մենք կատարում ենք ավանդական ռենտգեն հետազոտություններ, համակարգչային տոմոգրաֆիա, մագնիսառեզոնանսային տոմոգրաֆիա: Մեր փորձառու ռենտգենաբանները ապահովում են ճշգրիտ ախտորոշում՝ օգնելով բժիշկներին լավագույն բուժումը որոշելու գործում:',
    features: [
      'Ավանդական ռենտգեն հետազոտություններ',
      'Համակարգչային տոմոգրաֆիա (CT)',
      'Մագնիսառեզոնանսային տոմոգրաֆիա (MRI)',
      'Ճշգրիտ և արագ ախտորոշում',
      'Փորձառու մասնագետների թիմ'
    ]
  },
  {
    id: 'sonography',
    title: 'Սոնոգրաֆիա',
    icon: images.service15,
    description: 'Մեր սոնոգրաֆիայի բաժինը առաջարկում է ոչ ինվազիվ ուլտրաձայնային հետազոտություններ մարմնի տարբեր օրգանների վիճակը գնահատելու համար: Մենք կատարում ենք որովայնի, փափուկ հյուսվածքների, վահանաձև գեղձի, սրտի (էխոկարդիոգրաֆիա) և այլ օրգանների ուլտրաձայնային հետազոտություններ:',
    features: [
      'Որովայնի խոռոչի հետազոտություն',
      'Հետորովայնամիզային տարածության հետազոտություն',
      'Փոքր կոնքի խոռոչի օրգանների հետազոտություն',
      'Վահանագեղձի հետազոտություն',
      'Կրծքագեղձերի հետազոտություն',
      'Հոդերի հետազոտություն'
    ]
  },
  {
    id: 'cardiology',
    title: 'Սրտաբանություն',
    icon: images.service1,
    description: 'Մեր սրտաբանական բաժինը մասնագիտացած է սրտի և անոթային համակարգի հիվանդությունների կանխարգելման, ախտորոշման և բուժման մեջ: Մենք առաջարկում ենք համապարփակ սրտային հետազոտություններ, ներառյալ էլեկտրոկարդիոգրաֆիա (ԷԿԳ), էխոկարդիոգրաֆիա, սթրես թեստեր և Հոլտեր մոնիտորինգ: Մեր սրտաբանները բուժում են զարկերակային հիպերտենզիա, սրտի իշեմիկ հիվանդություն, սրտի արատներ և այլ սրտանոթային խնդիրներ:',
    features: [
      'Էլեկտրոկարդիոգրամ (ԷԿԳ)',
      'Էխոկարդիոգրամ',
      'Սթրես թեստեր',
      'Հոլտեր մոնիտորինգ',
      'Սրտի խորհրդատվություն',
      'Բարձր ճնշման կառավարում'
    ]
  },
  {
    id: 'traumatology',
    title: 'Վնասվածքաբանություն և օրթոպեդիա',
    icon: images.service16,
    description: 'Մեր վնասվածքաբանության և օրթոպեդիայի բաժինը բուժում է ոսկրերի, հոդերի, կապանների և մկանների խնդիրները: Մեր մասնագետները զբաղվում են ոսկրերի կոտրվածքների, հոդերի հիվանդությունների, սպորտային վնասվածքների, ողնաշարի խնդիրների ախտորոշմամբ և բուժմամբ:',
    features: [
      'Բոլոր տեսակի ներհոդային/հարհոդային ներարկումներ՝ սոնոգրաֆիկ հսկողությամբ',
      'Հոդախախտերի, կոտրվածքների ուղղում և անշարժացում՝ թերմապլաստիկ օրթեզներով',
      'Ոտնաթաթերի անհատական օրթոպեդիկ ներդիրների պատրաստում',
      'Սպորտային վնասվածքների բուժում',
      'Ողնաշարի խնդիրների ախտորոշում և բուժում'
    ]
  },
  {
    id: 'ophthalmology',
    title: 'Ակնաբուժություն',
    icon: images.service4,
    description: 'Մեր ակնաբուժության բաժինը առաջարկում է աչքի առողջության համապարփակ խնամք և հիվանդությունների ախտորում ու բուժում: Մենք առաջարկում ենք տեսողության համապարփակ ստուգումներ, աչքի հիվանդությունների ախտորոշում և բուժում, ներառյալ գլաուկոմ, կատարակտ, և ցանցաթաղանթի խնդիրներ:',
    features: [
      'Աչքի համապարփակ հետազոտություններ',
      'Տեսողության սրության ստուգում',
      'Գլաուկոմ ախտորոշում և բուժում',
      'Կատարակտի ախտորոշում և վիրահատություն',
      'Ցանցաթաղանթի հիվանդությունների բուժում',
      'Ակնոցների և կոնտակտային լինզաների նշանակում'
    ]
  }
];

// This will help us to search through the services
export const searchServices = (query) => {
  if (!query) return services;
  
  query = query.toLowerCase();
  return services.filter(service => 
    service.title.toLowerCase().includes(query) || 
    service.description.toLowerCase().includes(query) ||
    service.features.some(feature => feature.toLowerCase().includes(query))
  );
};
